Show / Hide Table of Contents
Class ReinfBarInclined
Representing reinforcement inclined bar in IDEA StatiCa Detail
Inheritance
System.Object
OpenObject
OpenElementId
Reinforcement
ReinforcementGroup
ReinfBarInclined
Inherited Members
 ReinforcementGroup.Diameter
 ReinforcementGroup.NumOfBarsInLayer
 ReinforcementGroup.CoverFromSetting
 ReinforcementGroup.Cover
 ReinforcementGroup.EndsTypeBeg
 ReinforcementGroup.EndsTypeEnd
 ReinforcementGroup.DiameterOfMandrel
 Reinforcement.ReinfId
 Reinforcement.Material
 OpenElementId.Id
 System.Object.ToString()
 System.Object.Equals(System.Object)
 System.Object.Equals(System.Object, System.Object)
 System.Object.ReferenceEquals(System.Object, System.Object)
 System.Object.GetHashCode()
 System.Object.GetType()
 System.Object.MemberwiseClone()
Namespace: IdeaRS.OpenModel.Detail
Assembly: IdeaRS.OpenModel.dll
Syntax
[OpenModelClass(typeof(Reinforcement))]
public class ReinfBarInclined : ReinforcementGroup
Constructors
Improve this Doc   View Source
ReinfBarInclined()
Constructor
Declaration
public ReinfBarInclined()
Properties
Improve this Doc   View Source
AddBarOnBottom
Add bar on Bottom - possible only for FullLength
Declaration
public bool AddBarOnBottom { get; set; }
Property Value
 Type |  Description
 System.Boolean
Improve this Doc   View Source
AddBarOnTop
Add bar on top - possible only for FullLength
Declaration
public bool AddBarOnTop { get; set; }
Property Value
 Type |  Description
 System.Boolean
Improve this Doc   View Source
Angle
Angle between bar and master edge
Declaration
public double Angle { get; set; }
Property Value
 Type |  Description
 System.Double
Improve this Doc   View Source
BottomLength
Length of additional bar on the bottom
Declaration
public double BottomLength { get; set; }
Property Value
 Type |  Description
 System.Double
Improve this Doc   View Source
InclinedReinfBarType
Type of inclined reinf bar
Declaration
public InclinedReinfBarType InclinedReinfBarType { get; set; }
Property Value
 Type |  Description
 InclinedReinfBarType
Improve this Doc   View Source
MasterComponent
Master component of reinforcement
Declaration
public ReferenceElement MasterComponent { get; set; }
Property Value
 Type |  Description
 ReferenceElement
Improve this Doc   View Source
MasterEdge
Master edge of reinforcement - edge from which is measured angle
Declaration
public ReferenceElement MasterEdge { get; set; }
Property Value
 Type |  Description
 ReferenceElement
Improve this Doc   View Source
MasterPoint
Master point of reinforcement
Declaration
public ReferenceElement MasterPoint { get; set; }
Property Value
 Type |  Description
 ReferenceElement
Improve this Doc   View Source
TopLength
Length of additional bar on the top
Declaration
public double TopLength { get; set; }
Property Value
 Type |  Description
 System.Double
 Improve this Doc
 View Source